Revit 2027 API
BuiltInFailures.RebarFailures.SpliceTypeWasDeleted Property
 Splice type was deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpliceTypeWasDeleted { get; }
Public Shared ReadOnly Property SpliceTypeWasDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpliceTypeWasDeleted {
	FailureDefinitionId^ get ();
}
static member SpliceTypeWasDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace